# Вебинар. Библиотека Pandas

## Проверка связи

**Поставьте в чат:**<br>
\+ если меня видно и слышно<br>
– если нет

**Если у вас нет звука:**

* убедитесь, что на вашем устройстве и в колонках включён звук

* обновите страницу вебинара или закройте страницу и переподключитесь

* откройте вебинар в другом браузере

* перезагрузите ваше устройство и войдите снова

## О спикере

**Погудина Дарья**
- эксперт-разработчик на Python в области информационной безопасности и в финтехе
- сертифицированный специалист по базам данных
- более 8 лет опыта разработки, из них более 4 лет — на Python
- 3 года в сфере информационной безопасности с разработкой ПО на Python

## Правила участия

*   Приготовьте блокнот и ручку, чтобы записывать важные мысли и идеи
*   Продолжительность вебинара — 80 минут
*   Вы можете писать свои вопросы в чате или задавать их вслух
*   Запись вебинара будет доступна в личном кабинете

## Цель занятия

Научиться работать с библиотекой Pandas:
- загружать данные из различных форматов внешних источников
- фильтровать, сортировать, группировать и агрегировать данные

## План занятия

1. Чтение данных из внешних источников
2. Методы датафреймов
3. Сортировка данных
4. Группировка данных
5. Экспорт данных

## Ваши вопросы

## 1. Чтение данных из внешних источников

### Импорт модуля pandas

In [ ]:
import pandas as pd

### Основные методы загрузки данных

| Метод                 | Что делает                                   | На вход                               | На выход           | Частые аргументы                       |
| --------------------- | -------------------------------------------- | ------------------------------------- | ------------------ | -------------------------------------- |
| `pd.read_clipboard()` | Читает таблицу, скопированную в буфер обмена | —                                     | `DataFrame`        | `sep` — разделитель, если не табуляция |
| `pd.read_html()`      | Извлекает таблицы из HTML-кода               | строка HTML **или** объект `StringIO` | список `DataFrame` | `match`, `attrs`, `flavor`             |
| `pd.read_csv()`       | Читает данные из CSV-файла                   | путь к файлу или URL                  | `DataFrame`        | `sep`, `encoding`, `nrows`, `usecols`  |
| `pd.read_json()`      | Читает данные из JSON                        | путь к файлу, строка JSON или URL     | `DataFrame`        | `orient`, `typ`                        |
| `pd.read_xml()`       | Читает XML-файлы                             | путь к файлу или строка XML           | `DataFrame`        | `xpath`                                |
| `pd.read_sql()`       | Выполняет SQL-запрос и возвращает результат  | SQL-запрос и объект подключения       | `DataFrame`        | —                                      |

In [ ]:
# Чтение из буфера обмена
df = pd.read_clipboard()
df.head() # Вывод первых строк датафрейма

#### Чтение данных из HTML

In [ ]:
import requests
from io import StringIO

url = 'https://en.wikipedia.org/wiki/Minnesota'

header = {
  "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
}

response = requests.get(url, headers=header)

html_str = StringIO(response.text)

df = pd.read_html(html_str)

type(df)
df[1].head()

      Location July (°F) July (°C) January (°F) January (°C)
0  Minneapolis     83/64     28/18         23/7       −4/−13
1   Saint Paul     83/63     28/17         23/6       −5/−14
2    Rochester     82/63     28/17         23/3       −5/−16
3       Duluth     76/55     24/13         19/1       −7/−17
4    St. Cloud     81/58     27/14        18/−1       −7/−18

In [ ]:
from bs4 import BeautifulSoup

# Разбираем HTML при помощи BeautifulSoup
soup = BeautifulSoup(response.text, "html.parser")

# Находим все таблицы
tables = soup.find_all("table")

print(f"Найдено таблиц: {len(tables)}")

# Берём первую таблицу и выводим первые 500 символов
print(tables[0].prettify()[:500])

Найдено таблиц: 28
<table class="infobox ib-settlement vcard">
 <tbody>
  <tr>
   <th class="infobox-above" colspan="2">
    <div class="fn org">
     Minnesota
    </div>
   </th>
  </tr>
  <tr>
   <td class="infobox-subheader" colspan="2">
    <div class="category">
     <a href="/wiki/U.S._state" title="U.S. state">
      State
     </a>
    </div>
   </td>
  </tr>
  <tr class="mergedtoprow">
   <td class="infobox-full-data maptable" colspan="2">
    <style data-mw-deduplicate="TemplateStyles:r1028600610">

In [ ]:
first_table_html = str(tables[1])
df = pd.read_html(StringIO(first_table_html))[0]
df.head()

      Location July (°F) July (°C) January (°F) January (°C)
0  Minneapolis     83/64     28/18         23/7       −4/−13
1   Saint Paul     83/63     28/17         23/6       −5/−14
2    Rochester     82/63     28/17         23/3       −5/−16
3       Duluth     76/55     24/13         19/1       −7/−17
4    St. Cloud     81/58     27/14        18/−1       −7/−18

In [ ]:
df = pd.read_html(html_str, attrs={'class': 'us-census-pop us-census-pop-right'})

df[0].head()

  Census     Pop. Note        %±
0   1850     6077  NaN         —
1   1860   172023  NaN  2,730.7%
2   1870   439706  NaN    155.6%
3   1880   780773  NaN     77.6%
4   1890  1310283  NaN     67.8%

In [ ]:
table = soup.find("table", {"class": "us-census-pop us-census-pop-right"})

df = pd.read_html(StringIO(str(table)))[0]
df.head()

  Census     Pop. Note        %±
0   1850     6077  NaN         —
1   1860   172023  NaN  2,730.7%
2   1870   439706  NaN    155.6%
3   1880   780773  NaN     77.6%
4   1890  1310283  NaN     67.8%

In [ ]:
pd.read_html(html_str, match = 'United States presidential election results for Minnesota')[0].head()

   Year Republican         Democratic         Third party(ies)
   Year        No.       %        No.       %              No.      %
0  2024    1519032  46.68%    1656979  50.92%            77909  2.39%
1  2020    1484065  45.28%    1717077  52.40%            76029  2.32%
2  2016    1323232  44.93%    1367825  46.44%           254176  8.63%
3  2012    1320225  44.96%    1546167  52.65%            70169  2.39%
4  2008    1275409  43.82%    1573354  54.06%            61606  2.12%

In [ ]:
# Находим все таблицы на странице
tables = soup.find_all("table")

# Проходим по каждой таблице и ищем ту, у которой заголовок (caption) содержит нужный текст
for table in tables:
    caption = table.find("caption")
    if caption and "United States presidential election results for Minnesota" in caption.text:
        df = pd.read_html(StringIO(str(table)))[0]
        print(df.head())
        break

   Year Republican         Democratic         Third party(ies)
   Year        No.       %        No.       %              No.      %
0  2024    1519032  46.68%    1656979  50.92%            77909  2.39%
1  2020    1484065  45.28%    1717077  52.40%            76029  2.32%
2  2016    1323232  44.93%    1367825  46.44%           254176  8.63%
3  2012    1320225  44.96%    1546167  52.65%            70169  2.39%
4  2008    1275409  43.82%    1573354  54.06%            61606  2.12%

#### Когда использовать `pandas`, а когда `BeautifulSoup`

| Ситуация | Лучше использовать | Почему |
|-----------|--------------------|--------|
| Нужно быстро получить **все таблицы** со страницы | `pandas.read_html()` | Простая команда, сразу возвращает список `DataFrame` |
| Нужно извлечь **одну таблицу по названию** или по **атрибутам (`class`, `id`)** | `pandas.read_html(..., match=...)` или `attrs={...}` | Удобно, если страница аккуратно размечена |
| Нужно извлечь **только часть таблицы**, или таблицу, у которой нет чётких атрибутов | `BeautifulSoup` + `pandas` | Позволяет гибко искать по тегам, тексту, структуре страницы |
| Нужно получить **другие данные** (списки, заголовки, тексты, ссылки) | `BeautifulSoup` | `pandas` работает только с таблицами |
| Страница **загружается динамически (через JS)** | `requests` + `BeautifulSoup` не помогут — нужен Selenium или API | В таких случаях данные нужно искать через API сайта или браузерную автоматизацию |

💡 **Итог:**  
`pandas.read_html()` — быстро и удобно, когда таблицы хорошо размечены.  
`BeautifulSoup` — гибко и точно, когда структура страницы сложная или нестандартная.  
Часто эти инструменты используют **вместе**: `requests` → `BeautifulSoup` → `pandas`.

#### Импорт данных из файлов

In [ ]:
# Чтение из csv-файла
df = pd.read_csv("AAPL.csv", sep=",")
df.head(5)

         Date      Open      High       Low     Close  Adj Close     Volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.406782  117258400
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.385558   43971200
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.357260   26432000
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.366103   21610400
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.376715   18362400

In [ ]:
# Чтение из файла json
df = pd.read_json("sample-stocks-data.json")
df.tail(10)

,company,description,initial_price,price_2002,price_2007,symbol
12,Microsoft,"Microsoft develops, manufactures, licenses, an...",55.72,22.62,29.84,MSFT
13,Monsanto,Monsanto provides agricultural products for fa...,11.47,7.20,86.93,MO
14,PepsiCo,"PepsiCo, Inc. manufactures, markets, and sells...",34.13,36.69,73.74,PEP
15,Starbucks,Starbucks Corp. provides specialty coffee and ...,6.23,10.50,26.84,SBUX
16,Texas Instruments,Texas Instruments designs and sells semiconduc...,53.88,15.58,36.54,TXN
17,Time Warner,Time Warner is a media and entertainment compa...,221.25,36.36,57.18,TWX
18,United Health,UnitedHealth Group provides healthcare service...,7.66,21.85,47.70,UNH
19,Walmart,"Walmart operates retail stores, warehouse club...",56.50,50.51,47.53,WMT
20,Whirlpool,Whirlpool manufactures and sells home applianc...,58.25,46.82,94.29,WHR
21,Xerox,"Xerox Corporation engages in the development, ...",20.87,5.26,17.54,XRX

In [ ]:
# Чтение из файла XML
pd.read_xml("stock.xml").head(5)

  categories    offers
0   \n        \n

#### Чтение данных напрямую из БД с использованием языка SQL

In [ ]:
password = "password"
user = "postgres"
pd.read_sql("""select symbol,
                           avg(volume) as avg_vol
                      from stocks
                     where extract(year from "date") = 2009
                     group by symbol
                     ;
""", f"postgresql://{user}:{password}@localhost:54321/example").head(5)

ImportError: Using URI string without sqlalchemy installed.

### Вывод данных датафрейма

In [ ]:
df.head() # Вывод первых строк датафрейма
df.tail() # Вывод последних строк датафрейма

,company,description,initial_price,price_2002,price_2007,symbol
17,Time Warner,Time Warner is a media and entertainment compa...,221.25,36.36,57.18,TWX
18,United Health,UnitedHealth Group provides healthcare service...,7.66,21.85,47.70,UNH
19,Walmart,"Walmart operates retail stores, warehouse club...",56.50,50.51,47.53,WMT
20,Whirlpool,Whirlpool manufactures and sells home applianc...,58.25,46.82,94.29,WHR
21,Xerox,"Xerox Corporation engages in the development, ...",20.87,5.26,17.54,XRX

### Параметры чтения датафрейма: head, sep и другие

In [ ]:
df = pd.read_csv("AAPL.csv", sep=',', names=['date','open','high','low','close','adj_close','volume'], header=0, date_format='%Y-%m-%d')
df.head(5)

         date      open      high       low     close  adj_close     volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.406782  117258400
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.385558   43971200
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.357260   26432000
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.366103   21610400
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.376715   18362400

In [ ]:
?pd.read_csv

## Ваши вопросы

## 2. Методы датафреймов

In [ ]:
# количество строк DF
print(len(df))

9909

In [ ]:
df.shape

(9909, 7)

### Простые методы вычисления для нового столбца

In [ ]:
# Если данные уже загружены с заголовками как данные
# Нужно удалить первую строку (которая содержит заголовки)
# df = df.iloc[1:]  # Удаляем первую строку

# Преобразуем столбцы в числовой тип
df['high'] = pd.to_numeric(df['high'])
df['low'] = pd.to_numeric(df['low'])

# Теперь можем выполнить вычисления
df['high_low_diff'] = df['high'] - df['low']

df.head()

,date,open,high,low,close,adj_close,volume,high_low_diff
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232

### Получение основных сведений о датафрейме

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9909 entries, 0 to 9908
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           9909 non-null   object
 1   open           9909 non-null   float64
 2   high           9909 non-null   float64
 3   low            9909 non-null   float64
 4   close          9909 non-null   float64
 5   adj_close      9909 non-null   float64
 6   volume         9909 non-null   int64
 7   high_low_diff  9909 non-null   float64
dtypes: float64(6), int64(1), object(1)
memory usage: 619.4+ KB

In [ ]:
df.describe()

,open,high,low,close,adj_close,volume,high_low_diff
count,9909.000000,9909.000000,9909.000000,9909.000000,9909.000000,9.909000e+03,9909.000000
mean,32.606849,32.936079,32.277560,32.618030,30.576570,8.582916e+07,0.658519
std,58.415759,59.001576,57.883037,58.471899,56.746275,8.597195e+07,1.422116
min,0.198661,0.198661,0.196429,0.196429,0.155638,3.472000e+05,0.000000
25%,1.071429,1.089286,1.048571,1.071429,0.917643,3.304230e+07,0.035714
50%,1.729286,1.758929,1.696429,1.732143,1.466154,5.766490e+07,0.072857
75%,35.799999,36.265713,35.328571,35.761429,31.042374,1.069992e+08,0.745714
max,324.739990,327.850006,323.350006,327.200012,327.200012,1.855410e+09,26.970016

In [ ]:
df.columns

Index(['date', 'open', 'high', 'low', 'close', 'adj_close', 'volume'], dtype='object')

In [ ]:
df[['open', 'close']]

            open       close
0       0.513393    0.513393
1       0.488839    0.486607
2       0.453125    0.450893
3       0.462054    0.462054
4       0.475446    0.475446
...          ...         ...
9904  246.520004  258.440002
9905  252.750000  247.740005
9906  250.740005  254.809998
9907  255.600006  254.289993
9908  246.500000  240.910004

[9909 rows x 2 columns]

### Отдельный столбец: обращение и методы

In [ ]:
df['volume'].head()

0    117258400
1     43971200
2     26432000
3     21610400
4     18362400
Name: volume, dtype: int64

In [ ]:
df.volume.head()

0    117258400
1     43971200
2     26432000
3     21610400
4     18362400
Name: volume, dtype: int64

In [ ]:
type(df['volume'])

pandas.core.series.Series

In [ ]:
# Уникальные значения в столбце
df.volume.unique()

array([117258400,  43971200,  26432000, ...,  41994100,  49250500,
        43956200], shape=(9350,))

In [ ]:
# Количество уникальных значений в столбце
len(df.volume.unique())

9350

In [ ]:
df.volume.nunique()

9350

In [ ]:
#Распределение количества строк по значениям столбца
df.volume.value_counts()

volume
61600000     7
61040000     6
59920000     6
75600000     5
63840000     5
            ..
184097200    1
89706400     1
65027200     1
55778800     1
38553200     1
Name: count, Length: 9350, dtype: int64

In [ ]:
df['volume'].value_counts(normalize=True)

volume
61600000     0.000706
61040000     0.000606
59920000     0.000606
75600000     0.000505
63840000     0.000505
               ...
184097200    0.000101
89706400     0.000101
65027200     0.000101
55778800     0.000101
38553200     0.000101
Name: proportion, Length: 9350, dtype: float64

In [ ]:
df.head()

,date,open,high,low,close,adj_close,volume,high_low_diff
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232

## Ваши вопросы

## 3. Сортировка данных

In [ ]:
df.sort_values(by='date')

,date,open,high,low,close,adj_close,volume,high_low_diff
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232
...,...,...,...,...,...,...,...,...
9904,2020-03-26,246.520004,258.679993,246.360001,258.440002,258.440002,63021800,12.319992
9905,2020-03-27,252.750000,255.869995,247.050003,247.740005,247.740005,51054200,8.819992
9906,2020-03-30,250.740005,255.520004,249.399994,254.809998,254.809998,41994100,6.120010
9907,2020-03-31,255.600006,262.489990,252.000000,254.289993,254.289993,49250500,10.489990
9908,2020-04-01,246.500000,248.720001,239.130005,240.910004,240.910004,43956200,9.589996

In [ ]:
df.sort_values(by='date', ascending=False)

,date,open,high,low,close,adj_close,volume,high_low_diff
9908,2020-04-01,246.500000,248.720001,239.130005,240.910004,240.910004,43956200,9.589996
9907,2020-03-31,255.600006,262.489990,252.000000,254.289993,254.289993,49250500,10.489990
9906,2020-03-30,250.740005,255.520004,249.399994,254.809998,254.809998,41994100,6.120010
9905,2020-03-27,252.750000,255.869995,247.050003,247.740005,247.740005,51054200,8.819992
9904,2020-03-26,246.520004,258.679993,246.360001,258.440002,258.440002,63021800,12.319992
...,...,...,...,...,...,...,...,...
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232

In [ ]:
df.sort_values(by=['volume', 'date'], ascending=[True, False])

,date,open,high,low,close,adj_close,volume,high_low_diff
524,1983-01-11,0.513393,0.526786,0.513393,0.520089,0.412087,347200,0.013393
2936,1992-07-27,1.633929,1.660714,1.616071,1.616071,1.344507,599200,0.044643
107,1981-05-18,0.500000,0.504464,0.500000,0.500000,0.396170,1041600,0.004464
103,1981-05-12,0.488839,0.495536,0.488839,0.488839,0.387327,1064000,0.006696
106,1981-05-15,0.491071,0.497768,0.491071,0.491071,0.389095,1226400,0.006696
...,...,...,...,...,...,...,...,...
4743,1999-09-21,2.613839,2.616071,2.464286,2.473214,2.146850,839389600,0.151786
6839,2008-01-23,19.455715,20.000000,18.020000,19.867144,17.245489,843242400,1.980000
4209,1997-08-07,1.026786,1.055804,1.013393,1.042411,0.904855,938859600,0.042411
4208,1997-08-06,0.901786,0.991071,0.892857,0.939732,0.815726,1047620000,0.098214
5003,2000-09-29,2.013393,2.071429,1.812500,1.839286,1.596575,1855410200,0.258929

In [ ]:
#Параметр inplace перезаписывает данные в DF
df.sort_values(by=['open', 'close'], ascending=[True, False], inplace=True)

In [ ]:
df.head()

,date,open,high,low,close,adj_close,volume,high_low_diff
394,1982-07-08,0.198661,0.198661,0.196429,0.196429,0.155638,41081600,0.002232
395,1982-07-09,0.203125,0.205357,0.203125,0.203125,0.160944,32104800,0.002232
393,1982-07-07,0.205357,0.207589,0.205357,0.205357,0.162713,7593600,0.002232
396,1982-07-12,0.207589,0.209821,0.207589,0.207589,0.164481,15848000,0.002232
392,1982-07-06,0.207589,0.207589,0.205357,0.205357,0.162713,21924000,0.002232

## Ваши вопросы

### 4. Группировка данных

### Функции, выполняемые над данными датафрейма

In [ ]:
def get_trand(row) -> str:
    return "bear" if row['open'] < row['close'] else 'bull' if row['open'] != row['close'] else 'floor'

# Применяем ко всему датафрейму, но используем только нужные столбцы
df['trand'] = df.apply(get_trand, axis=1)

df.head()

,date,open,high,low,close,adj_close,volume,trand
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,floor
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,bull
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,bull
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,floor
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,floor

In [ ]:
df['trand'] = df.apply(lambda row: "bear" if row['open'] < row['close'] else 'bull' if row['open'] != row['close'] else 'floor', axis=1)

df.head()

,date,open,high,low,close,adj_close,volume,trand
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,floor
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,bull
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,bull
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,floor
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,floor

In [ ]:
import numpy as np

df['trand'] = np.where(df['open'] < df['close'], 'bear',
           np.where(df['open'] != df['close'], 'bull', 'floor'))

df.head()

,date,open,high,low,close,adj_close,volume,trand
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,floor
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,bull
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,bull
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,floor
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,floor

In [ ]:
df['weekday'] = pd.to_datetime(df['date']).dt.day_name()

df.head()

,date,open,high,low,close,adj_close,volume,weekday
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,Friday
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,Monday
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,Tuesday
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,Wednesday
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,Thursday

In [ ]:
# Группировка по месяцам
df['month'] = pd.to_datetime(df['date']).dt.month
monthly_stats = df.groupby('month').agg({
    'open': 'mean',
    'high': 'max',
    'low': 'min',
    'close': 'mean',
    'volume': 'sum'
}).round(2)

monthly_stats.head()

        open    high   low  close       volume
month
1      33.51  327.85  0.32  33.51  94794431400
2      34.51  327.22  0.33  34.58  67243825000
3      34.42  304.00  0.25  34.45  73637328400
4      29.90  248.72  0.26  29.89  72077343500
5      30.51  215.31  0.25  30.55  64978307300

In [ ]:
# Группировка по трендам
if 'trand' in df.columns:
    trend_analysis = df.groupby('trand').agg({
        'volume': ['count', 'mean', 'std'],
        'close': ['mean', 'std']
    })

    trend_analysis.head()

## Ваши вопросы

### 5. Экспорт данных

In [ ]:
# Сохранение в CSV
df.to_csv('processed_stock_data.csv', index=False)

# Сохранение в Excel с несколькими листами
with pd.ExcelWriter('stock_analysis.xlsx') as writer:
    df.to_excel(writer, sheet_name='Raw Data', index=False)
    monthly_stats.to_excel(writer, sheet_name='Monthly Stats')
    if 'trand' in df.columns:
        trend_analysis.to_excel(writer, sheet_name='Trend Analysis')

# Сохранение в JSON
df.to_json('stock_data.json', orient='records', date_format='iso')

## Ваши вопросы

## Итоги занятия

Научились работать с библиотекой Pandas:
- загружать данные из различных форматов внешних источников
- фильтровать, сортировать, группировать и агрегировать данные